app/views/brochurelogs/_form.html.erb

SELECT "brochures".* FROM "brochures"
---
	<%= f.label "Brochure" %><br />
  	<%= collection_select(:brochurelog , :brochure_id, Brochure.all , :id, :name) %>