app/views/brochurelogs/index.html.erb


<p> <%= @brochurelogs.count %>/<%= Brochurelog.count %> Records Found </p>
---
SELECT "brochurelogs".* FROM "brochurelogs"