app/controllers/brochures_controller.rb

  def index
		if user_signed_in?
			Brochure.conndeve
			@brochures = Brochure.search(params[:search])
---
SELECT "brochures".* FROM "brochures"

  def show
	if user_signed_in?
		@brochure = Brochure.find(params[:id])
---
SELECT "brochures".* FROM "brochures" WHERE "brochures"."id" = ? LIMIT 1  [["id", "1"]]

  def create
	if user_signed_in?
		@brochure = Brochure.new(params[:brochure])
		@brochure.status = 'not approvaled'
		respond_to do |format|
		  if @brochure.save
---
INSERT INTO "brochures" ("brochurelog_id", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["brochurelog_id", nil], ["created_at", Fri, 15 Mar 2013 04:29:45 UTC +00:00], ["name", "test"], ["updated_at", Fri, 15 Mar 2013 04:29:45 UTC +00:00]]