app/controllers/brochurelogs_controller.rb

  def index
		if user_signed_in?
		@search = Brochurelog.metasearch(params[:search])
		if @search.nil?
			@brochurelogs = Brochurelog.all
---
SELECT "brochurelogs".* FROM "brochurelogs"