app/controllers/eventtypes_controller.rb

SELECT "eventtypes".* FROM "eventtypes"
---
  def index

		@search = Eventtype.metasearch(params[:search])
		@eventtypes = @search.paginate(:page => params[:page])