app/controllers/facilities_controller.rb

SELECT "facilities".* FROM "facilities"
---
  def index
    @facilities = Facility.all