app/controllers/programs_controller.rb

SELECT "programs".* FROM "programs"
---
  def index

		@search = Program.metasearch(params[:search])
			@programs = @search.paginate(:page => params[:page])