app/controllers/referrals_controller.rb

  def index
	if staff_signed_in?
		@referrals = Referral.search(params[:search])
---
SELECT "referrals".* FROM "referrals"