app/controllers/referrallogs_controller.rb

SELECT "referrallogs".* FROM "referrallogs"
---
  def index

			@search = Referrallog.metasearch(params[:search])
			@referrallogs = @search.paginate(:page => params[:page])