app/controllers/users_controller.rb

	def index
		if user_signed_in? && current_user.role_id == 1
			@users = User.search(params[:search])
---
SELECT "users".* FROM "users"

	def create
		if user_signed_in? && current_user.role_id == 1
			@user = User.new(params[:user])
			@user.db_id = 1
			if @user.save
---
INSERT INTO "users" ("created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "last_sign_in_at", "last_sign_in_ip", "remember_created_at", "reset_password_sent_at", "reset_password_token", "role", "sign_in_count", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)